## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_firewall.fw will be created
  + resource "azurerm_firewall" "fw" {
      + dns_proxy_enabled   = (known after apply)
      + firewall_policy_id  = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "testfirewall"
      + resource_group_name = "rg-terraform-github-actions"
      + sku_name            = "AZFW_VNet"
      + sku_tier            = "Standard"
      + threat_intel_mode   = "Deny"

      + ip_configuration {
          + name                 = "configuration"
          + private_ip_address   = (known after apply)
          + public_ip_address_id = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # azurerm_firewall_policy.fwpolicy will be created
  + resource "azurerm_firewall_policy" "fwpolicy" {
      + child_policies           = (known after apply)
      + firewalls                = (known after apply)
      + id                       = (known after apply)
      + location                 = "northeurope"
      + name                     = "fwpolicy"
      + resource_group_name      = "rg-terraform-github-actions"
      + rule_collection_groups   = (known after apply)
      + sku                      = "Standard"
      + threat_intelligence_mode = "Alert"

      + intrusion_detection {
          + mode = "Deny"
        }
    }

  # azurerm_network_security_group.fw-subnet-nsg will be created
  + resource "azurerm_network_security_group" "fw-subnet-nsg" {
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "nsg-fw-subnet"
      + resource_group_name = "rg-terraform-github-actions"
      + security_rule       = (known after apply)
    }

  # azurerm_network_security_group.gw-subnet-nsg will be created
  + resource "azurerm_network_security_group" "gw-subnet-nsg" {
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "nsg-gw-subnet"
      + resource_group_name = "rg-terraform-github-actions"
      + security_rule       = (known after apply)
    }

  # azurerm_network_security_rule.rule-1-fw will be created
  + resource "azurerm_network_security_rule" "rule-1-fw" {
      + access                      = "Allow"
      + description                 = "Allow all for test"
      + destination_address_prefix  = "*"
      + destination_port_range      = "*"
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "rule1"
      + network_security_group_name = "nsg-fw-subnet"
      + priority                    = 100
      + protocol                    = "*"
      + resource_group_name         = "rg-terraform-github-actions"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_network_security_rule.rule-1-gw will be created
  + resource "azurerm_network_security_rule" "rule-1-gw" {
      + access                      = "Allow"
      + description                 = "Allow all for test"
      + destination_address_prefix  = "*"
      + destination_port_range      = "*"
      + direction                   = "Outbound"
      + id                          = (known after apply)
      + name                        = "rule1"
      + network_security_group_name = "nsg-gw-subnet"
      + priority                    = 100
      + protocol                    = "*"
      + resource_group_name         = "rg-terraform-github-actions"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # azurerm_public_ip.fwpubip will be created
  + resource "azurerm_public_ip" "fwpubip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "northeurope"
      + name                    = "testpip"
      + resource_group_name     = "rg-terraform-github-actions"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # azurerm_public_ip.vpnpubip will be created
  + resource "azurerm_public_ip" "vpnpubip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "northeurope"
      + name                    = "vpnpubip"
      + resource_group_name     = "rg-terraform-github-actions"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # azurerm_resource_group.rghubnetworking will be created
  + resource "azurerm_resource_group" "rghubnetworking" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "rg-terraform-github-actions"
    }

  # azurerm_subnet.firewallsubnet will be created
  + resource "azurerm_subnet" "firewallsubnet" {
      + address_prefixes                              = [
          + "10.0.2.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "AzureFirewallSubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-terraform-github-actions"
      + virtual_network_name                          = "VNET-Hub"
    }

  # azurerm_subnet.gatewaysubnet will be created
  + resource "azurerm_subnet" "gatewaysubnet" {
      + address_prefixes                              = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "GatewaySubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-terraform-github-actions"
      + virtual_network_name                          = "VNET-Hub"
    }

  # azurerm_subnet_network_security_group_association.fw-subnet-ass will be created
  + resource "azurerm_subnet_network_security_group_association" "fw-subnet-ass" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_subnet_network_security_group_association.gw-subnet-ass will be created
  + resource "azurerm_subnet_network_security_group_association" "gw-subnet-ass" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "VNET-Hub"
      + resource_group_name = "rg-terraform-github-actions"
      + subnet              = (known after apply)
      + tags                = {
          + "deployment" = "tf"
        }
    }

  # azurerm_virtual_network_gateway.vpngw will be created
  + resource "azurerm_virtual_network_gateway" "vpngw" {
      + active_active                         = false
      + bgp_route_translation_for_nat_enabled = false
      + enable_bgp                            = false
      + generation                            = (known after apply)
      + id                                    = (known after apply)
      + ip_sec_replay_protection_enabled      = true
      + location                              = "northeurope"
      + name                                  = "VPN-GW-1"
      + remote_vnet_traffic_enabled           = false
      + resource_group_name                   = "rg-terraform-github-actions"
      + sku                                   = "Basic"
      + type                                  = "Vpn"
      + virtual_wan_traffic_enabled           = false
      + vpn_type                              = "RouteBased"

      + bgp_settings (known after apply)

      + ip_configuration {
          + name                          = "vnetGatewayConfig"
          + private_ip_address_allocation = "Dynamic"
          + public_ip_address_id          = (known after apply)
          + subnet_id                     = (known after apply)
        }

      + vpn_client_configuration {
          + address_space        = [
              + "192.168.0.0/24",
            ]
          + vpn_auth_types       = (known after apply)
          + vpn_client_protocols = (known after apply)

          + revoked_certificate {
              + name       = "Verizon-Global-Root-CA"
              + thumbprint = "912198EEF23DCAC40939312FEE97DD560BAE49B1"
            }

          + root_certificate {
              + name             = "DigiCert-Federated-ID-Root-CA"
              + public_cert_data = <<-EOT
                    MIIDuzCCAqOgAwIBAgIQCHTZWCM+IlfFIRXIvyKSrjANBgkqhkiG9w0BAQsFADBn
                    MQswCQYDVQQGEwJVUzEVMBMGA1UEChMMRGlnaUNlcnQgSW5jMRkwFwYDVQQLExB3
                    d3cuZGlnaWNlcnQuY29tMSYwJAYDVQQDEx1EaWdpQ2VydCBGZWRlcmF0ZWQgSUQg
                    Um9vdCBDQTAeFw0xMzAxMTUxMjAwMDBaFw0zMzAxMTUxMjAwMDBaMGcxCzAJBgNV
                    BAYTAlVTMRUwEwYDVQQKEwxEaWdpQ2VydCBJbmMxGTAXBgNVBAsTEHd3dy5kaWdp
                    Y2VydC5jb20xJjAkBgNVBAMTHURpZ2lDZXJ0IEZlZGVyYXRlZCBJRCBSb290IENB
                    MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAvAEB4pcCqnNNOWE6Ur5j
                    QPUH+1y1F9KdHTRSza6k5iDlXq1kGS1qAkuKtw9JsiNRrjltmFnzMZRBbX8Tlfl8
                    zAhBmb6dDduDGED01kBsTkgywYPxXVTKec0WxYEEF0oMn4wSYNl0lt2eJAKHXjNf
                    GTwiibdP8CUR2ghSM2sUTI8Nt1Omfc4SMHhGhYD64uJMbX98THQ/4LMGuYegou+d
                    GTiahfHtjn7AboSEknwAMJHCh5RlYZZ6B1O4QbKJ+34Q0eKgnI3X6Vc9u0zf6DH8
                    Dk+4zQDYRRTqTnVO3VT8jzqDlCRuNtq6YvryOWN74/dq8LQhUnXHvFyrsdMaE1X2
                    DwIDAQABo2MwYTAPBgNVHRMBAf8EBTADAQH/MA4GA1UdDwEB/wQEAwIBhjAdBgNV
                    HQ4EFgQUGRdkFnbGt1EWjKwbUne+5OaZvRYwHwYDVR0jBBgwFoAUGRdkFnbGt1EW
                    jKwbUne+5OaZvRYwDQYJKoZIhvcNAQELBQADggEBAHcqsHkrjpESqfuVTRiptJfP
                    9JbdtWqRTmOf6uJi2c8YVqI6XlKXsD8C1dUUaaHKLUJzvKiazibVuBwMIT84AyqR
                    QELn3e0BtgEymEygMU569b01ZPxoFSnNXc7qDZBDef8WfqAV/sxkTi8L9BkmFYfL
                    uGLOhRJOFprPdoDIUBB+tmCl3oDcBy3vnUeOEioz8zAkprcb3GHwHAK+vHmmfgcn
                    WsfMLH4JCLa/tRYL+Rw/N3ybCkDp00s0WUZ+AoDywSl0Q/ZEnNY0MsFiw6LyIdbq
                    M/s/1JRtO3bDSzD9TazRVzn2oBqzSa8VgIo5C1nOnoAKJTlsClJKvIhnRlaLQqk=
                EOT
            }
        }
    }

Plan: 15 to add, 0 to change, 0 to destroy.
```
</details>